Функция СведенияОВнешнейОбработке() Экспорт
	
	ПараметрыРегистрации = ДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке("2.4.5.71");
	
	ПараметрыРегистрации.Вставить("Вид", "ДополнительнаяОбработка");    ПараметрыРегистрации.Вставить("Наименование", "Выгрузка слотов номенклатуры и Поступлений в АА");
	ПараметрыРегистрации.Вставить("Версия", Метаданные().Комментарий);
	ПараметрыРегистрации.Вставить("БезопасныйРежим", Ложь);
	ПараметрыРегистрации.Вставить("Информация", Метаданные().Синоним);
	
	НоваяКоманда = ПараметрыРегистрации.Команды.Добавить();
	НоваяКоманда.Представление=НСтр("ru = 'Выгрузка слотов номенклатуры и Поступлений в АА'");
	НоваяКоманда.Идентификатор="ВыгрузкаСлотовИПоступлений";
	НоваяКоманда.Использование="ВызовСерверногоМетода";
	НоваяКоманда.ПоказыватьОповещение=Истина;
	НоваяКоманда.Модификатор="";
	
	Возврат ПараметрыРегистрации;
	
КонецФункции   

Процедура ВыполнитьКоманду(Идентификатор, ОбъектыНазначения) Экспорт        
	
	ИмяФайла = "\\wdmycloud\Public\Slots_Incomes_" + Константы.ПрефиксУзлаРаспределеннойИнформационнойБазы.Получить() + ".xml";
	
	ЗаписьЖурналаРегистрации("Обмен с АА", УровеньЖурналаРегистрации.Информация,,, 
			"Начало выгрузки слотов и поступлений. ");
	
	
	Обработка = Обработки.УниверсальныйОбменДаннымиXML.Создать();
	Обработка.РежимОбмена="Выгрузка";
	ВремФайл = ПолучитьИмяВременногоФайла("xml");
    МакетПравилОбмена = ПолучитьМакет("ПОД_КЭДО_АА");
    МакетПравилОбмена.Записать(ВремФайл);
    Обработка.ИмяФайлаПравилОбмена = ВремФайл;
    Обработка.ЗагружатьДанныеВРежимеОбмена = Истина;
    Обработка.ЗаписыватьРегистрыНаборамиЗаписей = Истина;
    Обработка.ЗапоминатьЗагруженныеОбъекты = Истина;
    Обработка.ИспользоватьОтборПоДатеДляВсехОбъектов = Истина;
	
	СекундВСутках = 86400;
	Обработка.ДатаНачала = НачалоДня(ТекущаяДата() - 3 * СекундВСутках);
    Обработка.ДатаОкончания = КонецДня(ТекущаяДата());
	ЗаписьЖурналаРегистрации("Обмен с АА", УровеньЖурналаРегистрации.Информация,,, 
			"Начало выгрузки слотов и поступлений. За период с: " + Обработка.ДатаНачала + " по:" + Обработка.ДатаОкончания);
    Обработка.ВыгружатьТолькоРазрешенные = Истина;
    Обработка.ИмяФайлаОбмена = ИмяФайла;
    Обработка.ТипУдаленияРегистрацииИзмененийДляУзловОбменаПослеВыгрузки = 0; // 0 - не снимать регистрацию, 1 - снимать регистрацию
    Обработка.ЗагрузитьПравилаОбмена();
    Обработка.ВыполнитьВыгрузку();
	Обработка = Неопределено;
	
	ЗаписьЖурналаРегистрации("Обмен с АА", УровеньЖурналаРегистрации.Информация,,, 
			"Конец. Выгружены слоты и поступления.");
	
КонецПроцедуры


Функция ПолучитьДатуФайла(Знач ИмяФайла) Экспорт
	
	Файл = Новый Файл(ИмяФайла);
	Возврат Файл.ПолучитьВремяИзменения();
	 
КонецФункции